Revit 2026 API

# IFCLevelInfo Properties

---

The IFCLevelInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DistanceToNextLevel | The distance to the next story level. |
|  | Elevation | The elevation of the level. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

IFCLevelInfo Class

Autodesk.Revit.DB.IFC Namespace